                             how do i rename columns in panadas dataframe

In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
ufo.columns
#column name

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [12]:
ufo.rename(columns = {'Colors Reported' : 'Colors_Reported' , 'Shape Reported' :'Shape_Reported' } , inplace = True)
#inplace meaning that we want the original DataFrame or Series to be modified

In [13]:
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')

In [15]:
#what if i want to rename all the columns
ufo_cols =['city' , 'Colors_Reported' , 'Shape_Reported' , 'state' , 'time']
ufo.columns = ufo_cols
ufo.columns
#it worked

Index(['city', 'Colors_Reported', 'Shape_Reported', 'state', 'time'], dtype='object')

In [17]:
# what if i want to rename columns while i am reading file
ufo_cols =['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time']
ufo = pd.read_csv('http://bit.ly/uforeports' , names = ufo_cols , header =0)
ufo.head()

                   City Colors_Reported Shape_Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [19]:
# lets prentend we have 100  columns and we want to replace all spaces with underscores
ufo_cols =['City', 'Colors Reported', 'Shape Reported', 'State', 'Time']
ufo.columns = ufo_cols
ufo.columns =ufo.columns.str.replace(' ' , '_')
ufo.head()

                   City Colors_Reported Shape_Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [ ]:
#and voila ;)